Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: This action cannot be undone. This will permanently delete the %(object)s workspace and all related workspace data.
sv: Denna åtgärd kan inte göras ogjord. Detta kommer att permanent ta bort arbetsområdet %(object)s och all data relaterad till arbetsområdet.

source: This includes workspace access-control teams, translation memory, and code-hosting connections.
sv: Detta inkluderar team för åtkomstkontroll av arbetsytor, översättningsminne och kodhostinganslutningar.

source: Workspace to remove
sv: Arbetsområde att ta bort

source: A translation file was synchronized with its repository.
sv: En översättningsfil synkroniserades med sitt förråd.

source: A language translation became fully translated after an individual edit. Automatic translation, uploads, and bulk edits do not emit this event.
sv: En språköversättning blev fullständigt översatt efter en individuell redigering. Automatisk översättning, uppladdningar och massredigeringar utlöser inte denna händelse.

source: An existing translation was edited by a user.
sv: En befintlig översättning redigerades av en användare.

source: A comment was added to a string.
sv: En kommentar lades till i en sträng.

source: A translation suggestion was added.
sv: Ett översättningsförslag lades till.

source: A previously untranslated string was translated by a user.
sv: En tidigare oöversatt sträng översattes av en användare.

source: A translation was added or changed by automatic translation. This is emitted instead of Translation added or Translation changed.
sv: En översättning har lagts till eller ändrats med automatisk översättning. Detta visas istället för Översättning tillagd eller Översättning ändrad.

source: A translation suggestion was accepted as the translation.
sv: Ett översättningsförslag godkändes som den slutgiltiga översättningen.

source: A translation was restored to an earlier value.
sv: En översättning återställdes till ett tidigare värde.

source: A translation was added or changed by a translation file upload. This is emitted instead of Translation added or Translation changed.
sv: En översättning lades till eller ändrades genom uppladdning av en översättningsfil. Detta visas istället för Översättning tillagd eller Översättning ändrad.

source: A source string was added outside repository or upload updates.
sv: En källsträng lades till utanför förråd eller uppladdningsuppdateringar.

source: A component was locked for translation.
sv: En komponent har spärrats för översättning.

source: A component was unlocked for translation.
sv: En komponent har gjorts tillgänglig för översättning.

source: Pending component changes were committed.
sv: Väntande komponentändringar har genomförts.

source: Repository changes were pushed upstream.
sv: Ändringarna i förrådet har skickats uppströms.

source: A repository was reset to its upstream state.
sv: Ett förråd återställdes till sitt uppströmsläge.

source: Upstream repository changes were merged.
sv: Ändringar i uppströmsförrådet har lagts in.

source: Repository changes were rebased on upstream.
sv: Förrådets ändringar ombaserades mot uppströms.

source: Merging upstream repository changes failed.
sv: Misslyckades med att lägga in uppströmsförrådets ändringar.

source: Rebasing repository changes failed.
sv: Ombasering av förrådets ändringar misslyckades.

source: Weblate could not parse a translation file.
sv: Weblate kunde inte tolka en översättningsfil.

source: A language translation was removed.
sv: En språköversättning togs bort.

source: A translation suggestion was removed.
sv: Ett översättningsförslag togs bort.

source: A translation was changed by a search-and-replace operation. This is emitted instead of Translation changed.
sv: En översättning ändrades genom en sök-ersättningsoperation. Det här visas istället för Översättning ändrad.

source: Pushing repository changes upstream failed.
sv: Att skicka förrådsförändringar uppströms misslyckades.

source: An obsolete translation suggestion was removed during cleanup.
sv: Ett föråldrat översättningsförslag togs bort under rensningen.

source: A source string was edited in Weblate.
sv: En källsträng redigerades i Weblate.

source: A new string was added in Weblate.
sv: En ny sträng lades till i Weblate.

source: The translation state of one or more strings was changed in bulk.
sv: Översättningstillståndet för en eller flera strängar ändrades i en samlad åtgärd.

source: Project or component visibility was changed.
sv: Projekt- eller komponentsynligheten ändrades.

source: A user was granted access.
sv: En användare har beviljats åtkomst.

source: A user's access was removed.
sv: En användares åtkomst togs bort.

source: A translation was approved during review.
sv: En översättning godkändes under granskningen.

source: A translation was marked as needing editing.
sv: En översättning har markerats som i behov av redigering.

source: A translation component was removed.
sv: En översättningskomponent togs bort.

source: A translation project was removed.
sv: Ett översättningsprojekt togs bort.

source: A translation project was renamed.
sv: Ett översättningsprojekt fick ett nytt namn.

source: A translation component was renamed.
sv: En översättningskomponent fick ett nytt namn.

source: A component was moved within a project.
sv: En komponent flyttades inom ett projekt.

source: A user made their first contribution to a translation.
sv: En användare gjorde sitt första bidrag till en översättning.

source: An announcement was posted.
sv: Ett tillkännagivande publicerades.

source: A component alert was triggered.
sv: En komponentvarning utlöstes.

source: A language translation was added.
sv: En språköversättning lades till.

source: A user requested a new language.
sv: En användare begärde ett nytt språk.

source: A translation project was created.
sv: Ett översättningsprojekt skapades.

source: A translation component was created.
sv: En översättningskomponent skapades.

source: A user was invited to a project.
sv: En användare bjöds in till ett projekt.

source: Weblate received a repository notification from a code host.
sv: Weblate fick en förrådsavisering från en kodvärd.

source: A translation file was replaced by an uploaded file.
sv: En översättningsfil ersattes av en uppladdad fil.

source: Project or component license information changed.
sv: Licensinformationen om projektet eller komponenten ändrades.

source: The contributor license agreement was changed.
sv: Licensavtalet för bidragsgivare ändrades.

source: A screenshot was associated with a string.
sv: En skärmdump kopplades till en sträng.

source: A screenshot image was uploaded.
sv: En skärmdumpsbild laddades upp.

source: A string was changed while synchronizing from the repository.
sv: En sträng ändrades under synkronisering från förrådet.

source: An add-on was installed.
sv: Ett tillägg installerades.

source: An add-on's configuration was changed.
sv: Ett tilläggs konfiguration ändrades.

source: An add-on was uninstalled.
sv: Ett tillägg avinstallerades.

source: A string was removed from a translation.
sv: En sträng togs bort från en översättning.

source: A string comment was removed.
sv: En strängkommentar togs bort.

source: A string comment was marked as resolved.
sv: En strängkommentar markerades som löst.

source: The explanation for a source string was updated.
sv: Förklaringen till en källsträng uppdaterades.

source: A component category was removed.
sv: En komponentkategori togs bort.

source: A component category was renamed.
sv: En komponentkategori fick ett nytt namn.

source: A component category was moved.
sv: En komponentkategori flyttades.

source: Weblate could not save a changed string.
sv: Weblate kunde inte spara en ändrad sträng.

source: A new string was found while synchronizing from the repository.
sv: En ny sträng upptäcktes vid synkroniseringen från förrådet.

source: A string was changed while processing an uploaded file.
sv: En sträng ändrades under bearbetningen av en uppladdad fil.

source: A new string was found while processing an uploaded file.
sv: En ny sträng hittades under bearbetningen av en uppladdad fil.

source: A translation was synchronized after uploading a source file.
sv: En översättning synkroniserades efter uppladdning av en källfil.

source: All language translations in a component became fully translated after an individual edit. Automatic translation, uploads, and bulk edits do not emit this event.
sv: Alla språköversättningar i en komponent blev helt översatta efter en enskild redigering. Automatisk översättning, uppladdningar och massredigeringar utlöser inte denna händelse.

source: A translation was marked as needing editing by an enforced check.
sv: En översättning markerades i behov av redigering vid en tvingande kontroll.

source: A translation edit was propagated to another matching string.
sv: En översättningsredigering fortplantades till en annan matchande sträng.

source: A file was uploaded to a translation.
sv: En fil laddades upp till en översättning.

source: Additional source-string flags were updated.
sv: Ytterligare källsträngsflaggor uppdaterades.

source: A font was uploaded.
sv: Ett typsnitt laddades upp.

source: An uploaded font was changed.
sv: Ett uppladdat typsnitt ändrades.

source: An uploaded font was removed.
sv: Ett uppladdat typsnitt togs bort.

source: Translation files were forcibly synchronized with the repository.
sv: Översättningsfilerna tvångssynkroniserades med förrådet.

source: Translation files were forcibly rescanned for changes.
sv: översättningsfilerna skannades tvingande om för ändringar.

source: A screenshot was removed.
sv: En skärmdump togs bort.

source: A label was added to a string.
sv: En etikett lades till på en sträng.

source: A label was removed from a string.
sv: En etikett togs bort från en sträng.

source: The repository working tree was cleaned up.
sv: Förrådets arbetskatalog rensades upp.

source: A source string was added while processing an uploaded file.
sv: En källsträng lades till vid bearbetning av en uppladdad fil.

source: Source string added in the upload
sv: En källsträng lades till i uppladdningen

source: A source string was added while synchronizing from the repository.
sv: En källasträng lades till under synkroniseringen från förrådet.

source: Source string added in the repository
sv: Källsträng lades till i förrådet

source: A project backup was created.
sv: En säkerhetskopia av ett projekt skapades.

source: Project backed up
sv: Projektet säkerhetskopierades

source: A project was restored from a backup.
sv: Ett projekt återställdes från en säkerhetskopia.

source: Project restored
sv: Projektet återställt

source: A component was restored from a backup.
sv: En komponent återställdes från en säkerhetskopia.

source: Component restored
sv: Komponent återställd

source: All selected edits by a user were reverted.
sv: Alla valda redigeringar av en användare återställdes.

source: User edit reverted
sv: Användarredigering återställd

source: A project setting was changed.
sv: En projektinställning ändrades.

source: Project setting changed
sv: Projektinställning ändrad

source: A component setting was changed.
sv: En komponentinställning ändrades.

source: Component setting changed
sv: Komponentinställning ändrad

source: A user's access permissions were changed.
sv: En användares åtkomstbehörigheter ändrades.

source: User access changed
sv: Användaråtkomst ändrad

source: A workspace was created.
sv: Ett arbetsområde skapades.

source: Workspace created
sv: Arbetsområde skapat

source: A workspace setting was changed.
sv: En inställning för ett arbetsområde ändrades.

source: Workspace setting changed
sv: Arbetsömrådes inställning ändrades

source: A project was moved into or out of a workspace.
sv: Ett projekt har flyttats till eller från ett arbetsområde.

source: Project moved
sv: Projekt flyttat

source: A remote repository update was completed.
sv: En uppdatering av fjärrförrådet slutfördes.

source: Remote repository updated
sv: Fjärrförrådet uppdaterat

source: Updating a remote repository failed.
sv: Uppdateringen av ett fjärrförråd misslyckades.

source: Remote repository update failed
sv: Fjärrförrådsuppdatering misslyckades

source: A component alert was dismissed.
sv: En komponentvarning avfärdades.

source: Alert dismissed
sv: Varning avfärdades

source: A component alert was reopened after its context changed.
sv: En komponentvarning återöppnades efter att dess sammanhang ändrades.

source: Alert reopened
sv: Varning återöppnad

source: Could not update POT file.
sv: Kunde inte uppdatera POT-filen.

source: POT updates do not update PO files.
sv: POT-uppdateringar uppdaterar inte PO-filer.

source: Repository updates are pulled manually. Configure repository hooks to automate pulling changes into Weblate.
sv: Uppdateringar från förrådet hämtas manuellt. Konfigurera förrådskrokar för att automatisera hämtningen av ändringar till Weblate.

source: Outbound translation delivery is manual. Configure a push URL or a pull or merge request integration to automate it.
sv: Utgående översättningsleverans är manuell. Konfigurera en push-URL eller en integration med pull- eller merge-förfrågningar för att automatisera den.

source: Define translation instructions to help translators.
sv: Definiera översättningsinstruktioner för att hjälpa översättare.

source: Improve source string screenshot coverage.
sv: Förbättra täckningen av skärmdumpar av källsträngar.

source: Add safe-html or auto-safe-html flag to avoid dangerous HTML from translators for strings which are rendered as HTML.
sv: Lägg till flaggan safe-html eller auto-safe-html för att undvika farlig HTML från översättare för strängar som renderas som HTML.

source: Recommended add-on
sv: Rekommenderat tillägg

source: Bilingual gettext PO file configured as monolingual.
sv: Tvåspråkig gettext PO-fil konfigurerad som enspråkig.

source: Glossary string management is disabled
sv: Hantering av ordlistesträngar är inaktiverad

source: Unused glossary language.
sv: Oanvänt ordlistespråk.

source: This component can be migrated to the Weblate GitHub App integration.
sv: Den här komponenten kan migreras till Weblate GitHub-appintegrationen.

source: Conflicting repository setup.
sv: Motstridig förrådsinställning.

source: Could not recover the repository.
sv: Kunde inte återställa förrådet.

source: Could not merge the pull request automatically.
sv: Kunde inte slå samman pull-begäran automatiskt.

source: Plural forms in %(component)s do not match the target translation. Automatic translation skipped pluralized strings and processed only single-form strings.
sv: Pluralformer i %(component)s matchar inte målöversättningen. Automatisk översättning hoppade över pluraliserade strängar och bearbetade endast strängar i en enda form.

source: Automatic translation skipped some translations because selected source components use a different source language.
sv: Automatisk översättning hoppade över vissa översättningar eftersom valda källkomponenter använder ett annat källspråk.

source: Automatic translation skipped some translations because no other source components were available.
sv: Automatisk översättning hoppade över några översättningar eftersom inga andra källkomponenter fanns tillgängliga.

source: The checksum has to be exactly 16 hexadecimal characters.
sv: Kontrollsumman måste vara exakt 16 hexadecimala tecken lång.

source: The checksum is invalid.
sv: Kontrollsumman är ogiltig.

source: Duplicate category or component slug.
sv: Dubblerad kategori- eller komponent-slug.

source: Duplicate category or component name.
sv: Dubblerat kategori- eller komponentnamn.

source: Duplicate category slug.
sv: Dubblerad kategori-slugg.

source: Duplicate label name.
sv: Dubblerat etikettnamn.

source: Duplicate team name.
sv: Dubblerat gruppnamn.

source: Screenshot image is missing.
sv: Skärmbilden saknas.

source: Duplicate check name.
sv: Dubblerat kontrollnamn.

source: Referenced category does not exist.
sv: Den refererade kategorin finns inte.

source: Component filename does not match its category and slug.
sv: Komponentens filnamn matchar inte dess kategori och slug.

source: Duplicate component slug.
sv: Dubblerad komponent-slugg.

source: Duplicate translation identifier.
sv: Dubblerad översättningsidentifierare.

source: Component has to contain exactly one source translation.
sv: Komponenten måste innehålla exakt en källöversättning.

source: Referenced translation does not exist.
sv: Den refererade översättningen finns inte.

source: Duplicate unit checksum.
sv: Dubblerad enhetkontrollsumma.

source: Referenced label does not exist.
sv: Den refererade etiketten finns inte.

source: A translated unit references a missing source unit.
sv: En översatt enhet refererar till en saknad källenhet.

source: Referenced unit does not exist.
sv: Den refererade enheten finns inte.

source: Screenshot filename is invalid.
sv: Filnamnet på skärmbilden är ogiltigt.

source: Referenced screenshot image does not exist.
sv: Den refererade skärmbilden finns inte.

source: Uploaded file is too big.
sv: Den uppladdade filen är för stor.

source: Could not validate screenshot: %(error)s
sv: Kunde inte validera skärmdumpen: %(error)s

source: Referenced component does not exist.
sv: Den refererade komponenten finns inte.

source: Referenced role does not exist.
sv: Den refererade rollen finns inte.

source: Repository data does not belong to a restored component.
sv: Data i förrådet tillhör inte en återställd komponent.

source: Repository-linked components can not contain repository data.
sv: Databaslänkade komponenter får inte innehålla databasdata.

source: The project repository directory already exists.
sv: Katalogen för projektförrådet finns redan.

source: redacted
sv: dolt

source: Changed settings
sv: Ändrade inställningar

source: The “{}” file was changed.
sv: Filen "{}" har ändrats.

source: Parsing of the “{}” file was enforced.
sv: Tolkning av filen "{}" genomfördes.

source: File “{}” was added.
sv: Filen "{}" har lagts till.

source: %(setting)s changed from "%(old)s" to "%(target)s".
sv: %(setting)s ändrades från ”%(old)s ” till ”%(target)s ”.

source: No workspace
sv: Ingen arbetsyta

source: Project moved from "%(old)s" to "%(target)s".
sv: Projekt flyttades från "%(old)s" till "%(target)s".

source: Backup file
sv: Säkerhetskopiefil

source: Backup created
sv: Säkerhetskopian skapad

source: Backup server
sv: Reservserver

source: Backup domain
sv: Reservdomän

source: Skipped components
sv: Utelämnade komponenter

source: Original component
sv: Originalkomponent

source: Suggestions pending
sv: Väntande förslag

source: Needs review
sv: Behöver granskas

source: This site runs Weblate for localizing a software project.
sv: Den här webbplatsen använder Weblate för att lokalisera ett programvaruprojekt.

source: Actionable by me
sv: Åtgärdbar av mig

source: Discovery configuration
sv: Konfiguration för upptäckt

source: Component discovery stopped because the repository contains too many paths.
sv: Komponentupptäckten stoppades eftersom arkivet innehåller för många sökvägar.

source: The language filter regular expression is too complex and took too long to evaluate.
sv: Språkfiltrets reguljära uttryck är för komplext och tog för lång tid att utvärdera.

source: The regular expression used to match discovered files is too complex and took too long to evaluate.
sv: Det reguljära uttrycket som användes för att matcha de upptäckta filerna är för komplicerat och det tog för lång tid att utvärdera det.

source: Component discovery stopped because matching translation files would require too many comparisons.
sv: Komponentupptäckten stoppades eftersom matchning av översättningsfiler skulle kräva för många jämförelser.

source: The file mask used for discovery is too complex and took too long to evaluate.
sv: Filmasken som används för upptäckt är för komplex och tog för lång tid att utvärdera.

source: Multiple base or new base files render to the same file mask %(mask)s (%(existing)s and %(new)s).
sv: Flera basfiler eller nya basfiler återges till samma filmask %(mask)s (%(existing)s och %(new)s).

source: Do not sort
sv: Sortera inte

source: Case-sensitive sort
sv: Skiftlägeskänslig sortering

source: Case-insensitive sort
sv: Icke-skiftlägeskänslig sortering

source: Contributor comments
sv: Kommentarer med uppgifter om bidragsgivare

source: Add contributor names and years to header comments. SPDX also converts existing recognized contributor comments to SPDX-FileCopyrightText entries.
sv: Lägg till bidragsgivarnas namn och årtal i filhuvudets kommentarer. SPDX konverterar också befintliga identifierade kommentarer med uppgifter om bidragsgivare till SPDX-FileCopyrightText-poster.

source: Controls previous msgid comments for fuzzy strings.
sv: Kontrollerar tidigare msgid-kommentarer efter fuzzy-strängar.

source: Remove obsolete strings
sv: Ta bort föråldrade strängar

source: Remove obsolete entries from PO files when saving translation changes or updating from a POT file.
sv: Ta bort föråldrade poster från PO-filer när du sparar översättningsändringar eller uppdaterar från en POT-fil.

source: Update language team header
sv: Uppdatera rubriken för språkgruppen

source: Lets Weblate update the "Language-Team" file header.
sv: Låt Weblate uppdatera filrubriken "Language-Team".

source: Update last translator header
sv: Uppdatera rubriken för den senaste översättaren

source: Lets Weblate update the "Last-Translator" file header.
sv: Låt Weblate uppdatera filrubriken "Last-Translator".

source: Update X-Generator header
sv: Uppdatera X-Generator-rubriken

source: Lets Weblate update the "X-Generator" file header.
sv: Låt Weblate uppdatera filrubriken "X-Generator".

source: Report msgid bugs to
sv: Rapportera msgid-fel till

source: Lets Weblate update the "Report-Msgid-Bugs-To" file header if Source string bug reporting address is set.
sv: Låt Weblate uppdatera filrubriken "Report-Msgid-Bugs-To" om källsträngens felrapporteringsadress är inställd.

source: Deduplicate identical strings
sv: Ta bort dubbletter av identiska strängar

source: Consolidates identical source strings into a single translation unit. Prevents translation loss during file restructuring or table reordering by removing position-dependent context.
sv: Sammanför identiska källsträngar till en enda översättningsenhet. Förhindrar att översättningar går förlorade vid omstrukturering av filer eller omordning av tabeller genom att ta bort positionsberoende sammanhang.

source: File encoding
sv: Filkodning

source: Encoding used for Java Properties files
sv: Kodning som används för Java-egenskapsfiler

source: Escape spreadsheet formulas
sv: Skydda kalkylbladsformler

source: Prefix values that look like spreadsheet formulas with an apostrophe when saving CSV files.
sv: Inled värden som ser ut som kalkylbladsformler med en apostrof när CSV-filer sparas.

source: Encoding used for GWT Properties files
sv: Kodning som används för GWT-egenskapsfiler

# Use DOS line endings ( ) instead of UNIX line endings ( ) in strings.
source: Use DOS line endings (\r\n) instead of UNIX line endings (\n) in strings.
sv: Använd DOS-radändelser (\r\n) istället för UNIX-radändelser (\n) i strängar.

source: Maximum line length
sv: Maximal radlängd

source: The maximum number of characters for each line in the output file.
sv: Det maximala antalet tecken för varje rad i utdatafilen.

source: Extract code blocks
sv: Extrahera kodblock

source: Whether to extract translatable content from code blocks in Markdown and MDX files.
sv: Huruvida översättningsbart innehåll skall extraheras från kodblock i Markdown- och MDX-filer.

source: Extract front matter
sv: Extrahera inledningen
